#include "Zhi.h"


unsigned int VAO;
unsigned int VBO;

int ckWidth = 1024;
int ckHeight = 768;



std::vector<float> vertices = {
	// 前面
	-0.5f, -0.5f, -0.5f, 1.0f, 0.0f, 0.0f,  0.0f, 0.0f,
	 0.5f, -0.5f, -0.5f, 0.0f, 1.0f, 0.0f,  1.0f, 0.0f,
	 0.5f,  0.5f, -0.5f, 0.0f, 0.0f, 1.0f,  1.0f, 1.0f,
	-0.5f,  0.5f, -0.5f, 1.0f, 1.0f, 0.0f,  0.0f, 1.0f,

	// 后面			   
	-0.5f, -0.5f,  0.5f, 1.0f, 0.0f, 0.0f,  0.0f, 0.0f,
	 0.5f, -0.5f,  0.5f, 0.0f, 1.0f, 0.0f,  1.0f, 0.0f,
	 0.5f,  0.5f,  0.5f, 0.0f, 0.0f, 1.0f,  1.0f, 1.0f,
	-0.5f,  0.5f,  0.5f, 1.0f, 1.0f, 0.0f,  0.0f, 1.0f,

	// 左面			   
	-0.5f, -0.5f, -0.5f, 1.0f, 0.0f, 0.0f,  0.0f, 0.0f,
	-0.5f,  0.5f, -0.5f, 0.0f, 1.0f, 0.0f,  1.0f, 0.0f,
	-0.5f,  0.5f,  0.5f, 0.0f, 0.0f, 1.0f,  1.0f, 1.0f,
	-0.5f, -0.5f,  0.5f, 1.0f, 1.0f, 0.0f,  0.0f, 1.0f,

	// 右面
	 0.5f, -0.5f, -0.5f, 1.0f, 0.0f, 0.0f,  0.0f, 0.0f,
	 0.5f,  0.5f, -0.5f, 0.0f, 1.0f, 0.0f,  1.0f, 0.0f,
	 0.5f,  0.5f,  0.5f, 0.0f, 0.0f, 1.0f,  1.0f, 1.0f,
	 0.5f, -0.5f,  0.5f, 1.0f, 1.0f, 0.0f,  0.0f, 1.0f,

	 // 下面			    
	 -0.5f, -0.5f, -0.5f, 1.0f, 0.0f, 0.0f,  0.0f, 0.0f,
	  0.5f, -0.5f, -0.5f, 0.0f, 1.0f, 0.0f,  1.0f, 0.0f,
	  0.5f, -0.5f,  0.5f, 0.0f, 0.0f, 1.0f,  1.0f, 1.0f,
	 -0.5f, -0.5f,  0.5f, 1.0f, 1.0f, 0.0f,  0.0f, 1.0f,

	 // 上面			    
	 -0.5f,  0.5f, -0.5f, 1.0f, 0.0f, 0.0f,  0.0f, 0.0f,
	  0.5f,  0.5f, -0.5f, 0.0f, 1.0f, 0.0f,  1.0f, 0.0f,
	  0.5f,  0.5f,  0.5f, 0.0f, 0.0f, 1.0f,  1.0f, 1.0f,
	 -0.5f,  0.5f,  0.5f, 1.0f, 1.0f, 0.0f,  0.0f, 1.0f
};


std::vector<float> triangleVertices = {
	// 第一个三角形（白色）
	-10.0f,  0.0f, -10.0f,   1.0f,  0.0f,  0.0f, // 顶点1
	 10.0f,  0.0f, -10.0f,   1.0f,  1.0f,  1.0f, // 顶点2
	-10.0f,  0.0f,  10.0f,   1.0f,  1.0f,  1.0f, // 顶点3

	// 第二个三角形（蓝色）
	 10.0f,  0.0f, -10.0f,   1.0f,  1.0f,  1.0f, // 顶点4
	 10.0f,  0.0f,  10.0f,   0.0f,  0.0f,  1.0f, // 顶点5
	-10.0f,  0.0f,  10.0f,   1.0f,  1.0f,  1.0f  // 顶点6
};

std::vector<int> indices = {
	// 前面
	0, 1, 2, 2, 3, 0,
	// 后面
	4, 5, 6, 6, 7, 4,
	// 左面
	8, 9, 10, 10, 11, 8,
	// 右面
	12, 13, 14, 14, 15, 12,
	// 下面
	16, 17, 18, 18, 19, 16,
	// 上面
	20, 21, 22, 22, 23, 20
};

//10个模型的位置向量
glm::vec3 cubePositions[] = {
glm::vec3(0.0f,  0.0f,  0.0f),
glm::vec3(-1.5f, -2.2f, -2.5f),
glm::vec3(2.4f, -0.4f, -3.5f),
glm::vec3(-1.7f,  3.0f, -7.5f),
glm::vec3(1.3f, -2.0f, -2.5f),
glm::vec3(1.5f,  2.0f, -2.5f),
glm::vec3(1.5f,  0.2f, -1.5f),
glm::vec3(-1.3f,  1.0f, -1.5f),

glm::vec3(-10.0f, -2.0f, -10.0f),
glm::vec3(0.0f, -2.0f, -10.0f),
glm::vec3(-10.0f, -2.0f, 0.0f),
glm::vec3(10.0f, -2.0f, -10.0f),
glm::vec3(10.0f, -2.0f, 0.0f),
glm::vec3(0.0f, -2.0f, 10.0f),
glm::vec3(-10.0f, -2.0f, 10.0f),
glm::vec3(10.0f, -2.0f, 10.0f),



};

glm::vec3 cpos = glm::vec3(0.0f, 0.0f, 5.0f);
glm::vec3 cfront = glm::vec3(0.0f, 0.0f, -1.0f);
glm::vec3 cfront_shuiping = glm::vec3(cfront.x, 0, cfront.z);
glm::vec3 cup = glm::vec3(0.0f, 1.0f, 0.0f);

GLuint triangleVBO, triangleVAO;